import { Link } from 'react-router-dom'

import { Card } from '@/components'

import s from './rules.module.scss'

export const Rules = () => {
  return (
    <div className={s.wrapper}>
      <Card className={s.card}>
        <h2 className={s.heading}>Пользовательское соглашение</h2>
        <p className={s.content}>
          <br />
          <br />
          <span>
            Сайт{' '}
            <Link className={s.link} to={'https://7vb.store'}>
              7vb.store
            </Link>{' '}
            (далее - 7vb или Сайт)
          </span>{' '}
          - это интернет-ресурс, который предоставляет Вспомогательные приложения для различных
          компьютерных игр. Вспомогательное приложение (далее - Вспомогательное приложение или
          Продукт) - это программное обеспечение, предназначенное для работы на компьютере, которое
          предоставляет Пользователю возможность превосходства над другими игроками компьютерной
          игры, для которой данное приложение было разработано, путём различных вспомогательных
          функций, влияющих на игровой процесс. Пользование Сайтом или Вспомогательным приложением
          возможно только на условиях, изложенных в настоящих Пользовательском и Лицензионном
          соглашениях. Если Вы не согласны с его условиями, то Вам следует немедленно прекратить
          использование Сайта и Вспомогательного приложения. Использование Сайта или
          Вспомогательного приложения означает, что Вы согласны с условиями настоящих Лицензионного
          и Пользовательского соглашений. Термины и определения
          <br />
          <br />
          Сайт — интернет-ресурс, расположенный в сети Интернет по адресу{' '}
          <Link className={s.link} to={'https://7vb.store'}>
            https://7vb.store
          </Link>
          . Под Сайтом в зависимости от контекста понимается также программное обеспечение Сайта,
          дизайн (графическое оформление) Сайта, База данных Сайта, любой его раздел и подраздел, а
          также информация, размещенная на Сайте Администрацией сайта. <br />
          <br />
          Администрация сайта — лицо, которому принадлежат все соответствующие исключительные
          имущественные права на Сайт или Вспомогательные приложения, включая права на доменное имя
          Сайта, и осуществляющее его администрирование.
          <br />
          <br />
          Пользователь — лицо, приобретшее Продукт 7vb. Для целей Пользовательского соглашения под
          Пользователем понимается также лицо, которое не приобретало Продукт, но осуществляет
          доступ к Сайту или Вспомогательному приложению и/или использует и/или использовало его.
          Любое лицо, осуществляющее доступ к Сайту или Вспомогательному приложению, этим
          автоматически подтверждает, что оно полностью согласно с положениями Пользовательского и
          Лицензионного соглашений, и что в отношении него применимы требования, установленные
          данными соглашениями.
          <br />
          <br />
          Информация — любые сведения, сообщения, данные независимо от формы их представления,
          размещаемые Пользователем на Сайте, в том числе: персональные данные Пользователей, ссылки
          на другие сайты, любые текстовые сообщения, фотографии (изображения), аудио-и/или
          видео-произведения, компьютерные программы, и др. файлы. <br />
          <br />
          База данных — это объективная форма предоставления и организации совокупных данных,
          систематизированных таким образом, чтобы эти данные могли быть найдены и обработаны с
          помощью программно-аппаратных и технических средств Сайта или Вспомогательного приложения.
          <br />
          <br />
          Спам — массовые, несанкционированные и/или неожидаемые получателями почтовые и другие
          рассылки рекламного, информационного, агитационного или иного характера.
          <br />
          <br />
          Любые термины и понятия, использующиеся в Соглашении и не нашедшие отражения в разделе
          «Термины и определения», будут толковаться в соответствии со смыслом, вытекающим из текста
          Пользовательского или Лицензинного соглашений. В случае возникновения любых разногласий
          относительно толкования термина и/или понятия, используемого в Пользовательском или
          Лицензионном соглашениях, применяться будет то толкование, которое будет определено
          Администрацией. Предмет и общие положения Пользовательского и Лицензионного соглашений
          <br />
          <br />
          Настоящие Пользовательское и Лицензионное соглашения (далее и ранее — Соглашение или
          Соглашения) устанавливает правила и условия пользования Сайтом или Вспомогательным
          приложением. Доступ к Сайту или Вспомогательному приложению, использование Сайта или
          Вспомогательного приложения и/или совершение любых иных действий на Сайте или в
          Вспомогательном приложении Пользователем означает, что Пользователь принимает и обязуется
          соблюдать все условия настоящего Соглашения. Настоящее Соглашение может быть изменено
          Администрацией в любое время без какого-либо специального уведомления. Новая редакция
          Соглашения вступает в силу с момента ее опубликования на Сайте, если иное не предусмотрено
          новой редакцией Соглашения. Лицензионное соглашение на использование Продукта 7vb
          <br />
          <br />
          Покупая нашу продукцию вы автоматически соглашаетесь с условиями предоставления услуг
          <br />
          <br />
          [1] Обход чита может перестать функционировать и прекратить обновления без возврата
          средств.
          <br />
          <br />
          [2] Возврат средств возможен только в случае полной неработоспособности чита на момент
          покупки + предоставления видео с доказательствами (от момента покупки до проверки софта).
          <br /> [3] Возврат средств при блокировке вашего аккаунта - НЕВОЗМОЖЕН <br />
          <br /> [4] Возврат средств если вы купили чит и ваша сборка не подходит под указанные в
          теме - НЕВОЗМОЖЕН <br />
          <br /> [5] Некоторый функционал может перестать работать после обновления игры - возврата
          средств нет <br />
          <br />
          [6] Если вы активировали ключ не на свое железо (Использование спуфера) - возврата средств
          нет (Сброс Hwid на усмотрение администрации проекта) <br />
          <br /> [7] Оскорбление администрации проекта - Отказ в технической помощи <br />
          <br />
          [8] Оскорбление участников, пользователей, покупателей запрещено - Отказ в технической
          помощи <br />
          <br />
          [9] Запрещается заниматься "Анти-Пиарной" деятельностью проекта - Отказ в технической
          помощи (Пример: Софт ху*ня не покупайте) <br />
          <br /> [10] Запуск запрещенных программ или наличие их на ПК / Попытки взлома - Манибека
          нет (Возможна блокировка подписки) <br />
          <br /> [11] Продажа / Перепродажа подписок на нашу продукцию без нашего согласия запрещена
          - блокировка подписки без восстановления <br />
          <br /> [12] Продление времени подписки в случае детекта / обновления - На усмотрение
          администрации <br />
          <br /> [13] Покупка софта в статусе USE AT RISK / UPDATE / DETECTED - Исключительно на ваш
          риск - Возврата средств нет <br />
          <br />
          [14] Мы не несем ответственность за Bsod (Синие экраны и т.д.) - в случае поломки Windows
          - манибека нет & компенсации ущерба нет
          <br />
          <br />
          Пользователь обязуется не распространять в интернете или в любом другом месте, где может
          храниться цифровая информация, Продукт 7vb.
          <br />
          <br />В качестве условия использования, Пользователь обязуется не использовать Продукт 7vb
          для каких-либо целей, являющихся незаконными или нарушающих Соглашение.
          <br />
          <br />
          Пользователь не имеет права на реверсинг, анализ, модификацию и т.п. Продукта 7vb, а также
          передачи своих авторизирующих данных ( логин и пароль ) и перепродажи Продукта 7vb третьим
          лицам.
          <br />
          <br />
          Для предотвращения распространения Продукта в интернете 7vb использует привязывание
          Продукта к компьютеру, что делает невозможным запуск Продукта на других или нескольких
          компьютерах. Продукт будет работать только на том компьютере, на котором он был запущен
          впервые. ( Внутри данного пункта: замена каких-либо внутренних устройств компьютера
          аналогичны запуску Продукта на другом компьютере )
          <br />
          <br />
          Любое нарушение правил карается бесконечной блокировкой подписки или любым другим способом
          наказания не нарушая условий Соглашения и прав Пользователя.
          <br />
          <br />
          Администрация 7vb имеет право на хранение и обработку конфиденциальной информации
          пользователя: имя компьютера, ip-адрес и любая другая возможная информация о Пользователе,
          которая не является личными данными Пользователя ( по типу паролей и файлов на компьютере
          Пользователя ), но может являться Персональными данными такового ( определяются условиями
          настоящего Соглашения ).
          <br />
          <br />
          Все возможные последствия использования Вспомогательных приложений Пользователь берёт на
          себя. Администрация не несёт никакой ответственности за возможные последствия
          использования Вспомогательных приложений.
          <br />
          <br />
          Пользователь даёт согласие на отправку анонимной статистики с целью улучшения качества
          Продукта 7vb.
          <br />
          <br />
          Все права на модификацию и распространение Продукта принадлежат 7vb.
        </p>
      </Card>
    </div>
  )
}
